tap "aws/tap"
tap "confluentinc/tap"
tap "derailed/k9s"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "infisical/get-cli"
tap "jkfran/killport"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
tap "nektos/tap"
tap "sdkman/tap"
tap "txn2/tap"
tap "weaveworks/tap"
brew "bat"
brew "claude-squad"
brew "cryptography"
brew "direnv"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "zstd"
brew "gcc"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "glib"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libomp"
brew "mitmproxy"
brew "mongodb-atlas-cli"
brew "neovim"
brew "poetry"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "shellcheck"
brew "snzip"
brew "sshuttle"
brew "tfenv"
brew "tig"
brew "tmux"
brew "tree"
brew "trippy"
brew "uv"
brew "watch"
brew "yq"
brew "z"
brew "zlib"
brew "zsh"
brew "aws/tap/eks-node-viewer"
brew "confluentinc/tap/cli"
brew "derailed/k9s/k9s"
brew "infisical/get-cli/infisical"
brew "jkfran/killport/killport"
brew "johanhaleby/kubetail/kubetail"
brew "mongodb/brew/mongodb-database-tools"
brew "sdkman/tap/sdkman-cli"
brew "txn2/tap/kubefwd"
brew "weaveworks/tap/eksctl"
cask "claudia"
cask "ngrok"
cask "warp"
