tap "anomalyco/tap"
tap "aws/tap"
tap "confluentinc/tap"
tap "derailed/k9s"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "infisical/get-cli"
tap "jkfran/killport"
tap "johanhaleby/kubetail"
tap "ksdme/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "txn2/tap"
tap "weaveworks/tap"
brew "bat"
brew "claude-squad"
brew "direnv"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "hadolint"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mise"
brew "mongocli"
brew "mongodb-atlas-cli"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "shellcheck"
brew "snzip"
brew "tfenv"
brew "tig"
brew "tmux"
brew "tree"
brew "trippy"
brew "trivy"
brew "trufflehog"
brew "uv"
brew "watch"
brew "yq"
brew "zoxide"
brew "zsh"
brew "starship"
brew "anomalyco/tap/opencode"
brew "aws/tap/eks-node-viewer"
brew "confluentinc/tap/cli"
brew "infisical/get-cli/infisical"
brew "johanhaleby/kubetail/kubetail"
brew "ksdme/tap/ut"
brew "mongodb/brew/mongodb-database-tools"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
brew "txn2/tap/kubefwd"
brew "weaveworks/tap/eksctl"
brew "derailed/k9s/k9s"
brew "jkfran/killport/killport"
cask "font-d2coding"
cask "font-hack-nerd-font"
cask "ghostty"
cask "warp"
