tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "yudai/gotty"

brew "gcc"
brew "gdal"
brew "git"
brew "mysql"
brew "mongodb"
brew "pyenv"
brew "python"
brew "shellcheck"
brew "tree"
brew "yarn"
brew "zlib"
brew "zsh"
brew "yudai/gotty/gotty"
brew "git-flow-avh"

cask "iterm2"
cask "dash"
cask "postman"
cask "visual-studio-code"
cask "docker"
cask "alfred"
cask "google-chrome"
cask "dbeaver-community"
cask "firefox"
cask "slack"
cask "typora"
