tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/core"
tap "nektos/tap"
tap "txn2/tap"
brew "bat"
brew "glib"
brew "direnv"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "graphviz"
brew "hadolint"
brew "helm"
brew "helmfile"
brew "jq"
brew "kubectx"
brew "mercurial"
brew "neovim"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "shellcheck"
brew "terraform"
brew "tmux"
brew "tree"
brew "watch"
brew "yq"
brew "z"
brew "zlib"
brew "zsh"
brew "nektos/tap/act"
brew "txn2/tap/kubefwd"
