tap "homebrew/bundle"
tap "homebrew/core"

brew "gcc"
brew "git"
brew "shellcheck"
brew "tree"
brew "zlib"
brew "zsh"
brew "git-flow-avh"
brew "ripgrep"
brew "jq"
brew "bat"
brew "direnv"
brew "kubectx"
brew "fzf"
brew "mercurial"
brew "z"
brew "neovim"
brew "watch"
brew "graphviz"
